[
  {
    "title": "tiny-interpolator",
    "img": "./thumbs/tiny-interpolator.png",
    "description": "I wanted an easy way to update the data on my <a href=\"http://nickmakes.website\">personal website</a> without digging through HTML every time. This is an npm module that lets you inject data into a template and render on the client side. It was made with the intent of being as simple and small as possible, with the minified version coming in at just under 1 Kb.",
    "link": "http://npmjs.com/package/tiny-interpolator",
    "githubLink": "https://github.com/nickells/tiny-interpolator"
  },
  {
    "title": "Breezeblocks",   
    "img": "./thumbs/breezeblocks.png",
    "description": "Built with Angular, this app gives users an intuitive drag-and-drop UI for prototyping React Native apps. Layout is converted into a JSON object and sent to the backend, where it is converted into JSX. This code is then uploaded to its own Github repo! This team project was built in fulfillment of the Fullstack Academy curriculum.",
    "link": "http://www.breezeblocks.io/",
    "githubLink": "https://github.com/nickells/Breezeblocks"
  },
  {
    "title": "Dictatone",   
    "img": "./thumbs/dictatone.png",
    "description": "Allows a user to sing, hum, or whistle into their microphone and see, magically, their melodies transcribed into printable sheet music. Won a \"Mad Scientist\" hackathon award at Fullstack. Also built in fulfillment of the Fullstack Academy curriculum.",
    "link": "http://dictatone.herokuapp.com/",
    "githubLink": "https://github.com/nickells/Dictatone"
  },
  {
    "title": "MementoDash",   
    "img": "./thumbs/mementodash.png",
    "description": "Loosely based off of Momentum Dashboard, this is a \"User Dashboard\" which takes images from the <a href=\"https://www.reddit.com/r/sfwpornnetwork/wiki/network\">\"SFWPorn\"</a> series on Reddit. Categories are chosen on the right side of the screen and images are accessed through the Imgur API. Built in Angular.",
    "link": "http://mementodash.herokuapp.com/",
    "githubLink": "https://github.com/nickells/mementodash.space"
  },
  {
    "title": "BlipCrowd",   
    "img": "./thumbs/blipcrowd.png",
    "description": "Creating a music sequencer was always something I'd had in mind since my very first-for loop. This one is unique because it uses websockets, meaning that anyone anywhere can collaborate on the same sequencer board simultaneously. (Also it's chromatic, while most are pentatonic. Personal preference.)",
    "link": "http://blipcrowd.herokuapp.com/",
    "githubLink": "https://github.com/nickells/blipcrowd"
  }
]